/***************************************************************
  通过定时器0进行外部触发计数，定时器1进行1s计时，定时器1每触发一
次中断通过计算定时器0的计数次数求得频率。
// 频率测量 NE555
**************************************************************/

#include "NE555F_lib.h"

uint fre;
uchar count = 0;

void initNE555Fre()
{
	TMOD = 0x15;	// T1:定时器 T0:计数器
	TH0 = TL0 = 0;  // 计数清零
	TL1 = 0x00;		// 设置定时初值
	TH1 = 0x4C;		// 设置定时初值
	TF0 = TF1 = 0;
	TR0 = TR1 = 1;
	ET1 = 1;
	EA = 1;
}

void timer() interrupt 3
{
	TL1 = 0x00;	// 设置重装
	TH1 = 0x4C;	// 设置重装
	if (count++ == 20)
	{
		count = 0;
		fre = (uint) (TH0 << 8) | TL0;
		TL0 = TH0 = 0;
	}
}